_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input_Sequence (InputLayer)  (None, 13, 78)            0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 13, 600)           684000    
_________________________________________________________________
bidirectional_2 (Bidirection (None, 13, 600)           1623600   
_________________________________________________________________
bidirectional_3 (Bidirection (None, 600)               1623600   
_________________________________________________________________
Dense_1 (Dense)              (None, 300)               180300    
_________________________________________________________________
Dense_2 (Dense)              (None, 200)               60200     
_________________________________________________________________
Dense_3 (Dense)              (None, 100)               20100     
_________________________________________________________________
Prediction (Dense)           (None, 1)                 101       
=================================================================
Total params: 4,191,901
Trainable params: 4,191,901
Non-trainable params: 0
_________________________________________________________________
