_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input_Sequence (InputLayer)  (None, 13, 78)            0         
_________________________________________________________________
Conv_1 (Conv1D)              (None, 13, 450)           421650    
_________________________________________________________________
Conv_2 (Conv1D)              (None, 13, 225)           1215225   
_________________________________________________________________
Conv_3 (Conv1D)              (None, 13, 100)           270100    
_________________________________________________________________
Flatten (Flatten)            (None, 1300)              0         
_________________________________________________________________
Dense_1 (Dense)              (None, 300)               390300    
_________________________________________________________________
Dense_2 (Dense)              (None, 200)               60200     
_________________________________________________________________
Dense_3 (Dense)              (None, 100)               20100     
_________________________________________________________________
Prediction (Dense)           (None, 1)                 101       
=================================================================
Total params: 2,377,676
Trainable params: 2,377,676
Non-trainable params: 0
_________________________________________________________________
