_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input_Sequence (InputLayer)  (None, 121, 78)           0         
_________________________________________________________________
Conv_1 (Conv1D)              (None, 121, 450)          421650    
_________________________________________________________________
Conv_2 (Conv1D)              (None, 121, 225)          1215225   
_________________________________________________________________
Conv_3 (Conv1D)              (None, 121, 100)          270100    
_________________________________________________________________
Flatten (Flatten)            (None, 12100)             0         
_________________________________________________________________
Dense_1 (Dense)              (None, 300)               3630300   
_________________________________________________________________
Dense_2 (Dense)              (None, 200)               60200     
_________________________________________________________________
Dense_3 (Dense)              (None, 100)               20100     
_________________________________________________________________
Prediction (Dense)           (None, 1)                 101       
=================================================================
Total params: 5,617,676
Trainable params: 5,617,676
Non-trainable params: 0
_________________________________________________________________
