_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input_Sequence (InputLayer)  (None, 121, 78)           0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 121, 1200)         2448000   
_________________________________________________________________
bidirectional_2 (Bidirection (None, 121, 1200)         6487200   
_________________________________________________________________
bidirectional_3 (Bidirection (None, 1200)              6487200   
_________________________________________________________________
Dense_1 (Dense)              (None, 600)               720600    
_________________________________________________________________
Dense_2 (Dense)              (None, 300)               180300    
_________________________________________________________________
Dense_3 (Dense)              (None, 200)               60200     
_________________________________________________________________
Prediction (Dense)           (None, 1)                 201       
=================================================================
Total params: 16,383,701
Trainable params: 16,383,701
Non-trainable params: 0
_________________________________________________________________
